public class miles_for_rewards {
public static void main(String[] args) {

    System.out.println("Здравствуйте");
    int amount = 3000; // Сумма покупки
    int bonus = amount / 20; // Количество полученных бонусов
    System.out.println("Вы получите " + bonus + " бонусных миль");
}
     // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }

